# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"

# Command-line tools
brew "gh"                    # GitHub CLI
brew "git-filter-repo"       # Git history rewriting
brew "starship"              # Cross-shell prompt
brew "uv"                    # Fast Python package installer and resolver

# GUI Applications
cask "cursor"                # AI-powered code editor
cask "discord"               # Voice and chat for communities
cask "ghostty"               # Terminal emulator
cask "google-chrome"         # Web browser
cask "notion"                # Note-taking and organization
cask "raycast"               # Spotlight replacement
cask "setapp"                # App subscription service
cask "slack"                 # Team communication
cask "visual-studio-code"    # Code editor
cask "whatsapp"              # Messaging app
cask "zoom"                  # Video conferencing

# Fonts
cask "font-fira-code"        # Popular coding font with ligatures (optional backup)
