brew "gh"
brew "git-filter-repo"
brew "starship"
vscode "adam-watters.vscode-color-pick"
vscode "adamwalzer.scss-lint"
vscode "adpyke.vscode-sql-formatter"
vscode "agathist.agathist-vscode-themes"
vscode "akamud.vscode-theme-onedark"
vscode "alduncanson.react-hooks-snippets"
vscode "alexanderalekseenko.darky-purple-theme"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "azemoh.one-monokai"
vscode "batisteo.vscode-django"
vscode "beardedbear.beardedtheme"
vscode "biomejs.biome"
vscode "bsides.theme-base16-eighties"
vscode "burkeholland.simple-react-snippets"
vscode "chrisbibby.hide-node-modules"
vscode "christian-kohler.npm-intellisense"
vscode "dangmai.workspace-default-settings"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "eliverlara.andromeda"
vscode "enkia.tokyo-night"
vscode "eriklynd.json-tools"
vscode "esbenp.prettier-vscode"
vscode "felipecaputo.git-project-manager"
vscode "firefox-devtools.vscode-firefox-debug"
vscode "firsttris.vscode-jest-runner"
vscode "fisheva.eva-theme"
vscode "fivepointseven.vscode-theme-onedark-spacegray"
vscode "formulahendry.auto-rename-tag"
vscode "fwcd.kotlin"
vscode "gaearon.subliminal"
vscode "github.github-vscode-theme"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "igorming.useful-react-snippets"
vscode "ionutvmi.spacegray-vscode"
vscode "itarato.byesig"
vscode "iulian-radu-at.fix-relative-imports-to-baseurl"
vscode "jprestidge.theme-material-theme"
vscode "jvitorfrancisco.theme-acid-purple"
vscode "kevinrose.vsc-python-indent"
vscode "kgscott.retreon"
vscode "koichisasada.vscode-rdbg"
vscode "lextudio.restructuredtext"
vscode "loilo.snazzy-light"
vscode "lourenci.go-to-spec"
vscode "luqimin.tiny-light"
vscode "magicstack.magicpython"
vscode "matangover.mypy"
vscode "mathiasfrohlich.kotlin"
vscode "max-ss.cyberpunk"
vscode "mgmcdermott.vscode-language-babel"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "neotan.vscode-auto-restart-typescript-eslint-servers"
vscode "nikolaosgeorgiou.html-fmt-vscode"
vscode "njpwerner.autodocstring"
vscode "nkzq.nojquery-snippets"
vscode "onecrayon.theme-quietlight-vsc"
vscode "orta.vscode-jest"
vscode "oscarmcm.ocean-space"
vscode "parallaxshiftdj.midnightrainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "rokoroku.vscode-theme-darcula"
vscode "rvest.vs-code-prettier-eslint"
vscode "samrapdev.outrun"
vscode "samuelcolvin.jinjahtml"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "sdras.night-owl"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "sidthesloth.html5-boilerplate"
vscode "sleistner.vscode-fileutils"
vscode "snooty.snooty"
vscode "sorbet.sorbet-vscode-extension"
vscode "sporto.rails-go-to-spec"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "tal7aouy.theme"
vscode "tamasfe.even-better-toml"
vscode "techer.open-in-browser"
vscode "thedavej.night-owl-black"
vscode "thegeoffstevens.best-dark-themes-pack"
vscode "thertzlor.semantic-rainbow"
vscode "timonwong.shellcheck"
vscode "tinkertrain.theme-panda"
vscode "tobiastimm.sceanic"
vscode "tyriar.sort-lines"
vscode "uloco.theme-bluloco-dark"
vscode "uloco.theme-bluloco-light"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "whizkydee.material-palenight-theme"
vscode "wholroyd.jinja"
vscode "wmaurer.change-case"
vscode "yummygum.city-lights-theme"
vscode "yuritoledo.outrun-space"
vscode "zhuangtongfa.material-theme"
